package ru.fefu.marathonsskillsapp.main_page.lists

class MarathonListRepository {
    private val listItem = listOf(

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        ),

        ListItem.Item(
            distance = "Кросс Быстрый Пес",
            time = "17.04.2022",
            cost = "100$",
            startTime = "14:15",
            endTime = "17:01",
            activity = "Россия",
            user = "2км 3км 5км",
            info = "Размер и порода не важны — мы ждём всех, кто готов преодолеть 2 км в своё удовольствие. Маршрут проложен в один круг. Покрытие грунтовое, возможна глубокая грязь и лужи — вашей собаке точно понравится!\n" +
                    "\n" +
                    "Формат кросса подразумевает раздельные старты. Участники будут стартовать по несколько пар с интервалами между группами. Победителей и призёров определят по личному времени. Все участники получат значок на финише.",
        )
    )

    fun getItem() : List<ListItem> = listItem
}